app/controllers/carts_controller.rb

SELECT "products".* FROM "products" INNER JOIN "orderitems" ON "products"."id" = "orderitems"."product_id" WHERE "orderitems"."order_id" = $1  [["order_id", 17]]
---
  def show
    @order
    @products = @order.products
    @orderitems = @order.orderitems