app/controllers/products_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "products".* FROM "products" INNER JOIN "categories_products" ON "products"."id" = "categories_products"."product_id" WHERE "categories_products"."category_id" = $1  [["category_id", 3]]
---
  def index
    if params[:category_id]
      @category = Category.find(params[:category_id])
      @products = @category.products
    elsif params[:user_id]
      @merchant = User.find(params[:user_id])
      @products = @merchant.products
    else
      @products = Product.all

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_product
    @product = Product.find_by(id: params[:id])