app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "review", "created_at", "updated_at", "product_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["rating", 4], ["review", "Okay product"], ["created_at", "2018-04-24 20:44:57.305189"], ["updated_at", "2018-04-24 20:44:57.305189"], ["product_id", 1]]
---
  def create
    @review = Review.new(review_params)
    @review.product = @product
    if @review.save

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def find_product
    @product = Product.find_by(id: params[:product_id])