app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 AND "users"."provider" = $2 LIMIT $3  [["uid", "22872775"], ["provider", "github"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "username", "email", "created_at", "updated_at", "uid", "provider") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    auth_hash = request.env['omniauth.auth']
      @user = User.find_by(uid: auth_hash[:uid], provider: 'github')

      if @user
        session[:user_id] = @user.id
        flash[:success] = "Logged in successfully"
      else
        @user = User.new(
          name: auth_hash['info']['name'],
          email: auth_hash['info']['email'],
          username: user_name(auth_hash['info']['email']),
          uid: auth_hash[:uid],
          provider: ['github'])
          @user.save