app/views/products/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = $1  [["product_id", 1]]
---
</br>
<% @product.reviews.each do |r| %>