app/views/reviews/new.html.erb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
<h1>Write a Review for <%= Product.find(params[:id]).name %></h1>